const globalMessages = {
	start: {
		en: '👋 Hey! Choose a language:',
		ua: '👋 Привіт! Виберіть мову:',
		ru: '👋 Привет! Выберите язык:'
	},
	greeting: {
		en: 'Hey! Happy to see you here🥰\n\nIf you are here, that means just one thing. You are the fan of English🇬🇧❤️So am I.\n\nI do hope to see you in our super cool community of the same fans of 🇺🇸🇬🇧 as you are🤞🏻\n\nThis bot is gonna help you make the coolest 😎 decision in your life! \n\nFind out more about our community and join asap❤️\n\nWith love,\nVicky!',
		ua: 'Привіт! Рада бачити тебе тут🥰\n\nЯкщо ти тут, то це означає лише одне!\nТи фанат англійської🇬🇧❤️ як і я. \n\nДуже сподіваюсь побачити тебе в нашому крутому ком’юніті таких фанатів 🇺🇸🇬🇧 як і ти🤞🏻\n\nЦей бот допоможе тобі у прийнятті  the coolest 😎 рішенні в твоєму житті! \n\nДізнайся більше про наше ком’юніті і приєднуйся ❤️\n\nWith love,\nVicky.',
		ru: 'Привет! Рада видеть тебя здесь🥰\n\nЕсли ты здесь, это значит только одно! Ты фанат английского 🇺🇸❤️ как и я.\n\nОчень надеюсь увидеть тебя в нашем крутом комьюнити таких же фанатов 🇺🇸🇬🇧 как и ты🤞🏻\n\nЭтот бот поможет принять the coolest 😎 решение в твоей жизни!\n\nУзнай больше про наше комьюнити и присоединяйся❤️ \n\nWith love,\nVicky.'
	},
	whatInteresting: {
		en: '🔥 What interests you?',
		ua: '🔥 Що вас цікавить?',
		ru: '🔥 Что вас интересует?'
	},
	givePayLink: {
		en: "You have definitely made the right decision to join us🇬🇧❤️🇺🇸\n\nHere is your link for the payment⬇️\n%payLink%\n\nP.S. For your convenience, the channel works as a subscription. So, you don't have to worry about the payment each month, as you're gonna be charged automatically🤩\n\nBut you'll always be able to check the number of days left to your next payment🔥",
		ua: 'Ти точно зробив/ла правильне рішення приєднавшись до нас🇬🇧❤️🇺🇸 \n\nТримай посилання на оплату⬇️\n%payLink%\n\nP.S. Для твоєї зручності, канал працюю по підписці, тому тобі не треба турбуватися кожен місяць про оплату, вона буде автоматична🤩 \n\nAле ти завжди зможеш перевірити кількість днів до наступної оплати🔥',
		ru: 'Ты точно сделал(а) правильное решение присоединившись к нам 🇬🇧❤️🇺🇸\n\nДержи ссылку на оплату⬇️\n%payLink%\n\nP.S. Для твоего удобства, канал работает по подписке, а значит тебе не нужно переживать об оплате каждый месяц, ведь она будет автоматическая🤩\n\nНо ты всегда сможешь проверить количество оставшихся дней к следующей оплате🔥'
	},
	successPay: {
		en: 'Congrats! 🥳 You are now the part of the coolest English learners - lovers community ❤️\n\nHere is your link for the channel ⬇️\n%channelInviteLink%\n\nAnd the chat⬇️\n%chatInviteLink%',
		ua: 'Вітаю! 🥳 Ти тепер частина крутого English learners - lovers community ❤️\n\nТримай посилання на канал⬇️\n%channelInviteLink%\n\nІ чат⬇️\n%chatInviteLink%',
		ru: 'Поздравляю! 🥳 Ты теперь часть крутого English learners - lovers community ❤️\n\nДержи ссылку на канал ⬇️\n%channelInviteLink%\n\nИ чат⬇️\n%chatInviteLink%'
	},
	aboutChannel: {
		en: "`Community of English learners-lovers! 🇬🇧❤️🇺🇸` \n\nIf you follow me on Instagram, you know for sure that I am a fan of English. And if you are here, then most likely you are too😏 \n\nSo, I definitely encourage you to join us, because here you will find only cool English, and most importantly, you will learn it with pleasure (because this IS the secret of success🤫) \n\nWe will study new cool vocabulary, grammar (and no, not as boring as at school) and practice it all together🤩\n\nAnd don't forget about the chat where you can finally practice English with others (learn more about the chat 📲⬇️)",
		ua: '`Ком’юніті of English learners-lovers! 🇬🇧❤️🇺🇸`\n\nЯкщо ти підписан/а на мене в інсті, то точно знаєш, що я фанат англійської. І я якщо ти тут, то скоріш за все і ти теж😏\n\nТому я точно раджу приєднатися до нас, бо тут ти знайдеш лише круту англійську, а найважливіше будеш вивчати її з задоволеням(бо і це і є секрет успіху🤫) \n\nМи будемо вивчати нову крутезну лексику, граматику (і ні, не так нудно як у школі) і все це практикувати разом🤩 \n\nІ не забувай про чат, ти нарешті зможеш практикувати англійську з іншими🥰 (дізнайся більше про чат 📲⬇️)',
		ru: '`Коммьюнити of English learners-lovers! 🇬🇧❤️🇺🇸`\n\nЕсли ты подписан/а на меня в инсти, то точно знаешь, что я фанат английского. И я если ты здесь, то, скорее всего, и ты тоже😏 \n\nПоэтому я точно советую присоединиться к нам, потому что здесь ты найдешь только крутой английский, а самое важное будешь изучать его с удовольствием (потому что и это и есть секрет успеха 🤫) \n\nМы будем изучать новую крутую лексику, грамматику (и нет, не так скучно как в школе) и все это практиковать вместе🤩 \n\nИ не забывай о чате, ты наконец-то сможешь практиковать английский с другими (узнай больше о чате 📲⬇️)'
	},
	aboutChat: {
		en: "`Community of English learners-lovers 🇬🇧❤️🇺🇸 | CHAT`\n\nWhat kind of community would it be without the community itself?\n\nThat's why it was decided to unite us not only for the sake of learning and enjoying English, but also to communicate and practice everything together!\n\nI'll 'spill you some beans' 🤫 we will even have lives where there will be an opportunity to practice English live with me😱 well, isn't it cool🔥\n\nEnglish is in your pocket 😎 you definitely don't want to miss this opportunity, join ❤️",
		ua: '`Community of English learners-lovers 🇬🇧❤️🇺🇸 | CHAT`\n\nЯке ж то було б ком’юніті без самого ком’юніті?\n\nТому було прийняте рішення об’єднати нас не лише метою вивчити і кайфувати англійською, але й спілкуватися і практикувати все разом! \n\nВідкрию секрет 🤫 ми навіть будемо проводити лайви, де буде можливість практикувати інгліш наживо😱 ну хіба не круто🔥\n\nАнглійська в твоїй кишені 😎 ти точно не хочеш пропустити таку можливість , приєднуйся❤️',
		ru: '`Community of English learners-lovers 🇬🇧❤️🇺🇸 | CHAT`\n\nКакое бы это было комьюнити без самого комьюнити?\n\nПоэтому было принято решение объединить нас не только целью изучить и кайфовать на английском, но и общаться и практиковаться вместе!\n\nОткрою секрет 🤫 мы даже будем проводить лайвы, где будет возможность практиковать инглиш вживую😱 ну разве не круто🔥\n\nАнглийский в твоем кармане 😎 ты точно не хочешь упустить такую возможность, присоединяйся❤️'
	},
	getSupport: {
		en: 'You experience any problems or just have some additional questions, feel free to text me❤️\n\n%telegram% - Telegram\n\n%instagram% - Instagram\n\n%email% - E-Mail',
		ua: "Якщо з'явилися труднощі або додаткові питання, ти завжди можеш мені написати❤️\n\n%telegram% - Telegram\n\n%instagram% - Instagram\n\n%email% - E-Mail",
		ru: 'Если возникли трудности или дополнительные вопросы, ты всегда можешь мне написать❤️\n\n%telegram% - Telegram\n\n%instagram% - Instagram\n\n%email% - E-Mail'
	},
	backButton: {
		en: '🔙 Back',
		ua: '🔙 Назад',
		ru: '🔙 Назад'
	}
}

const menuMessages = {
	accessChannel: {
		en: '💸 Buy subscription',
		ua: '💸 Купити підписку',
		ru: '💸 Купить подписку'
	},
	subscribeInfo: {
		en: '🔥 Check subscription',
		ua: '🔥 Перевірити підписку',
		ru: '🔥 Проверить подписку'
	},
	aboutChannel: {
		en: '📄 About the channel',
		ua: '📄 Дізнатись про канал',
		ru: '📄 Узнать о канале'
	},
	aboutChat: {
		en: '✉️ About the chat',
		ua: '✉️ Дізнатися про чат',
		ru: '✉️ Узнать о чате'
	},
	support: {
		en: '❓ Support',
		ua: '❓ Підтримка',
		ru: '❓ Поддержка'
	},
	changeLocale: {
		en: '🇬🇧 Change the language',
		ua: '🇺🇦 Змінити мову',
		ru: '🇷🇺 Изменить язык'
	}
}

const paymentMessages = {
	checkPayment: {
		en: '❔ Check payment status',
		ua: '❔ Перевірити статус оплати',
		ru: '❔ Проверить статус оплаты'
	},
	cancelPayment: {
		en: '❌ Cancel payment',
		ua: '❌ Скасувати оплату',
		ru: '❌ Отменить оплату'
	},
	checkPaymentResult: {
		en: '`Payment #%orderId%`\nPayment status: %statusText%\nAmount: %amount% %currency%',
		ua: '`Платіж #%orderId%`\nСтатус: %statusText%\nСума: %amount% %currency%',
		ru: '`Платеж #%orderId%`\nСтатус: %statusText%\nСумма: %amount% %currency%'
	},
	created: {
		en: 'Waiting for payment',
		ua: 'Очікування платежу',
		ru: 'Ожидание платежа'
	},
	approved: {
		en: 'Payment was successful',
		ua: 'Платіж пройшов успішно',
		ru: 'Платеж прошел успешно'
	},
	processing: {
		en: 'Payment processing',
		ua: 'Обробка платежу',
		ru: 'Обработка платежа'
	},
	expired: {
		en: 'Payment has expired',
		ua: 'Строк дії платежу минув',
		ru: 'Срок действия платежа истёк'
	},
	declined: {
		en: 'Payment declined',
		ua: 'Платіж відхилений',
		ru: 'Платеж отклонен'
	}
}

const merchantMessages = {
	orderDesc: {
		en: '💸 Subscribe to English with Vicky',
		ua: '💸 Підписка на English with Vicky',
		ru: '💸 Подписка на English with Vicky'
	}
}

export { globalMessages, menuMessages, paymentMessages, merchantMessages }
