const globalMessages = {
	start: {
		en: '👋 Hey! Choose a language:',
		ua: '👋 Привіт! Виберіть мову:',
		ru: '👋 Привет! Выберите язык:'
	},
	greeting: {
		en: 'Hey! Happy to see you here🥰\n\nIf you are here, that means just one thing. You are the fan of English🇬🇧❤️So am I.\n\nI do hope to see you in our super cool community of the same fans of 🇺🇸🇬🇧 as you are🤞🏻\n\nThis bot is gonna help you make the coolest 😎 decision in your life! \n\nFind out more about our community and join asap❤️\n\nWith love,\nVicky!',
		ua: 'Привіт! Рада бачити тебе тут🥰\n\nЯкщо ти тут, то це означає лише одне!\nТи фанат англійської🇬🇧❤️ як і я. \n\nДуже сподіваюсь побачити тебе в нашому крутому ком’юніті таких фанатів 🇺🇸🇬🇧 як і ти🤞🏻\n\nЦей бот допоможе тобі у прийнятті  the coolest 😎 рішенні в твоєму житті! \n\nДізнайся більше про наше ком’юніті і приєднуйся ❤️\n\nWith love,\nVicky.',
		ru: 'Привет! Рада видеть тебя здесь🥰\n\nЕсли ты здесь, это значит только одно! Ты фанат английского 🇺🇸❤️ как и я.\n\nОчень надеюсь увидеть тебя в нашем крутом комьюнити таких же фанатов 🇺🇸🇬🇧 как и ты🤞🏻\n\nЭтот бот поможет принять the coolest 😎 решение в твоей жизни!\n\nУзнай больше про наше комьюнити и присоединяйся❤️ \n\nWith love,\nVicky.'
	},
	whatInteresting: {
		en: '🔥 What interests you?',
		ua: '🔥 Що вас цікавить?',
		ru: '🔥 Что вас интересует?'
	},
	givePayLink: {
		en: "You have definitely made the right decision to join us🇬🇧❤️🇺🇸\n\nHere is your link for the payment⬇️\n%payLink%\n\nP.S. For your convenience, the channel works as a subscription. So, you don't have to worry about the payment each month, as you're gonna be charged automatically🤩 \n\n❗️❗️❗️BUT It's gonna work only if you're going to use your card details for your first payment (NOT apple pay/google pay)❗️❗️❗️\n\n➕ you'll always be able to check the number of days left to your next payment🔥",
		ua: 'Ти точно зробив/ла правильне рішення приєднавшись до нас🇬🇧❤️🇺🇸\n\nТримай посилання на оплату⬇️\n%payLink%\n\nP.S. Для твоєї зручності, канал працює по підписці, тому тобі не треба турбуватися кожен місяць про оплату, вона буде автоматична🤩 \n\n❗️❗️❗️АЛЕ автоматична підписка буде працювати лише якщо ти скористаєшся оплатою по реквізитам карти при першій оплаті (НЕ apple pay/google pay)❗️❗️❗️\n\n➕ти завжди зможеш перевірити кількість днів до наступної оплати🔥',
		ru: 'Ты точно сделал(а) правильное решение присоединившись к нам 🇬🇧❤️🇺🇸 \n\nДержи ссылку на оплату⬇️\n%payLink%\n\nP.S. Для твоего удобства, канал работает по подписке, а значит тебе не нужно переживать об оплате каждый месяц, ведь она будет автоматическая🤩\n\n❗️❗️❗️ Но автоматическая подписка будет работать только если ты воспользуешься оплатой по реквизитам карты при первой оплате (НЕ apple pay/google pay)❗️❗️❗️\n\n➕ ты всегда сможешь проверить количество оставшихся дней к следующей оплате🔥'
	},
	successPay: {
		en: 'Congrats! 🥳 You are now the part of the coolest English learners - lovers community ❤️\n\nHere is your link for the channel ⬇️\n%channelInviteLink%\n\nAnd the chat⬇️\n%chatInviteLink%',
		ua: 'Вітаю! 🥳 Ти тепер частина крутого English learners - lovers community ❤️\n\nТримай посилання на канал⬇️\n%channelInviteLink%\n\nІ чат⬇️\n%chatInviteLink%',
		ru: 'Поздравляю! 🥳 Ты теперь часть крутого English learners - lovers community ❤️\n\nДержи ссылку на канал ⬇️\n%channelInviteLink%\n\nИ чат⬇️\n%chatInviteLink%'
	},
	aboutChannel: {
		en: "`Community of English learners-lovers! 🇬🇧❤️🇺🇸` \n\nIf you follow me on Instagram, you know for sure that I am a fan of English. And if you are here, then most likely you are too😏 \n\nSo, I definitely encourage you to join us, because here you will find only cool English, and most importantly, you will learn it with pleasure (because this IS the secret of success🤫) \n\nWe will study new cool vocabulary, grammar (and no, not as boring as at school) and practice it all together🤩\n\nAnd don't forget about the chat where you can finally practice English with others (learn more about the chat 📲⬇️)",
		ua: '`Ком’юніті of English learners-lovers! 🇬🇧❤️🇺🇸`\n\nЯкщо ти підписан/а на мене в інсті, то точно знаєш, що я фанат англійської. І я якщо ти тут, то скоріш за все і ти теж😏\n\nТому я точно раджу приєднатися до нас, бо тут ти знайдеш лише круту англійську, а найважливіше будеш вивчати її з задоволеням(бо і це і є секрет успіху🤫) \n\nМи будемо вивчати нову крутезну лексику, граматику (і ні, не так нудно як у школі) і все це практикувати разом🤩 \n\nІ не забувай про чат, ти нарешті зможеш практикувати англійську з іншими🥰 (дізнайся більше про чат 📲⬇️)',
		ru: '`Коммьюнити of English learners-lovers! 🇬🇧❤️🇺🇸`\n\nЕсли ты подписан/а на меня в инсти, то точно знаешь, что я фанат английского. И я если ты здесь, то, скорее всего, и ты тоже😏 \n\nПоэтому я точно советую присоединиться к нам, потому что здесь ты найдешь только крутой английский, а самое важное будешь изучать его с удовольствием (потому что и это и есть секрет успеха 🤫) \n\nМы будем изучать новую крутую лексику, грамматику (и нет, не так скучно как в школе) и все это практиковать вместе🤩 \n\nИ не забывай о чате, ты наконец-то сможешь практиковать английский с другими (узнай больше о чате 📲⬇️)'
	},
	aboutChat: {
		en: "`Community of English learners-lovers 🇬🇧❤️🇺🇸 | CHAT`\n\nWhat kind of community would it be without the community itself?\n\nThat's why it was decided to unite us not only for the sake of learning and enjoying English, but also to communicate and practice everything together!\n\nI'll 'spill you some beans' 🤫 we will even have lives where there will be an opportunity to practice English live with me😱 well, isn't it cool🔥\n\nEnglish is in your pocket 😎 you definitely don't want to miss this opportunity, join ❤️",
		ua: '`Community of English learners-lovers 🇬🇧❤️🇺🇸 | CHAT`\n\nЯке ж то було б ком’юніті без самого ком’юніті?\n\nТому було прийняте рішення об’єднати нас не лише метою вивчити і кайфувати англійською, але й спілкуватися і практикувати все разом! \n\nВідкрию секрет 🤫 ми навіть будемо проводити лайви, де буде можливість практикувати інгліш наживо😱 ну хіба не круто🔥\n\nАнглійська в твоїй кишені 😎 ти точно не хочеш пропустити таку можливість , приєднуйся❤️',
		ru: '`Community of English learners-lovers 🇬🇧❤️🇺🇸 | CHAT`\n\nКакое бы это было комьюнити без самого комьюнити?\n\nПоэтому было принято решение объединить нас не только целью изучить и кайфовать на английском, но и общаться и практиковаться вместе!\n\nОткрою секрет 🤫 мы даже будем проводить лайвы, где будет возможность практиковать инглиш вживую😱 ну разве не круто🔥\n\nАнглийский в твоем кармане 😎 ты точно не хочешь упустить такую возможность, присоединяйся❤️'
	},
	getSupport: {
		en: 'You experience any problems or just have some additional questions, feel free to text me❤️\n\n%telegram% - Telegram\n\n%instagram% - Instagram\n\n%email% - E-Mail',
		ua: "Якщо з'явилися труднощі або додаткові питання, ти завжди можеш мені написати❤️\n\n%telegram% - Telegram\n\n%instagram% - Instagram\n\n%email% - E-Mail",
		ru: 'Если возникли трудности или дополнительные вопросы, ты всегда можешь мне написать❤️\n\n%telegram% - Telegram\n\n%instagram% - Instagram\n\n%email% - E-Mail'
	},
	backButton: {
		en: '🔙 Back',
		ua: '🔙 Назад',
		ru: '🔙 Назад'
	},
	on: {
		en: 'enabled',
		ua: 'увімкнена',
		ru: 'включена'
	},
	off: {
		en: 'disabled',
		ua: 'вимкнена',
		ru: 'выключена'
	}
}

const menuMessages = {
	accessChannel: {
		en: '💸 Buy subscription',
		ua: '💸 Купити підписку',
		ru: '💸 Купить подписку'
	},
	subscribeInfo: {
		en: '🔥 Check subscription',
		ua: '🔥 Перевірити підписку',
		ru: '🔥 Проверить подписку'
	},
	extendSubscribe: {
		en: '💸 Renew your subscription',
		ua: '💸 Продовжити підписку',
		ru: '💸 Продлить подписку'
	},
	cancelSubscribe: {
		en: '❌ Cancel subscription',
		ua: '❌ Скасувати підписку',
		ru: '❌ Отменить подписку'
	},
	aboutChannel: {
		en: '📄 About the channel',
		ua: '📄 Дізнатись про канал',
		ru: '📄 Узнать о канале'
	},
	aboutChat: {
		en: '✉️ About the chat',
		ua: '✉️ Дізнатися про чат',
		ru: '✉️ Узнать о чате'
	},
	support: {
		en: '❓ Support',
		ua: '❓ Підтримка',
		ru: '❓ Поддержка'
	},
	changeLocale: {
		en: '🇬🇧 Change the language',
		ua: '🇺🇦 Змінити мову',
		ru: '🇷🇺 Изменить язык'
	}
}

const paymentMessages = {
	checkPayment: {
		en: '❔ Check payment status',
		ua: '❔ Перевірити статус оплати',
		ru: '❔ Проверить статус оплаты'
	},
	cancelPayment: {
		en: '🔙 Back to menu',
		ua: '🔙 Назад у меню',
		ru: '🔙 Назад в меню'
	},
	checkPaymentResult: {
		en: '`Payment #%orderId%`\nPayment status: %statusText%\nAmount: %amount% %currency%',
		ua: '`Платіж #%orderId%`\nСтатус: %statusText%\nСума: %amount% %currency%',
		ru: '`Платеж #%orderId%`\nСтатус: %statusText%\nСумма: %amount% %currency%'
	},
	created: {
		en: 'Waiting for payment',
		ua: 'Очікування платежу',
		ru: 'Ожидание платежа'
	},
	approved: {
		en: 'Payment was successful',
		ua: 'Платіж пройшов успішно',
		ru: 'Платеж прошел успешно'
	},
	processing: {
		en: 'Payment processing',
		ua: 'Обробка платежу',
		ru: 'Обработка платежа'
	},
	expired: {
		en: 'Payment has expired',
		ua: 'Строк дії платежу минув',
		ru: 'Срок действия платежа истёк'
	},
	declined: {
		en: 'Payment declined',
		ua: 'Платіж відхилений',
		ru: 'Платеж отклонен'
	}
}

const subscribeMessages = {
	autoPayApproved: {
		en: 'Your subscription has been automatically renewed for 1 month',
		ua: 'Твоя підписка була автоматично продовжена на 1 місяць',
		ru: 'Твоя подписка была автоматически продлена на 1 месяц'
	},
	autoPayFailed: {
		en: "Hey there! Something went wrong😔 and we couldn't make an automatic payment to prolong your subscription🙁\n\nYou can always text me using 'Support' on the menu OR you can wait till the end of you subscription and then 'buy' a new one (BUT you'll have to write me anyway so that I can get you back you to the channel.)\n\nSorry for the inconveniences, but you know that it's worth it🥰❤️",
		ua: 'Привіт! Щось пішло не так 😔 і ми не змогли зробити автоматичний платіж для продовження твоєї підписки 🙁\n\nТи завжди можеш написати мені, використовуючи "Підтримка" в меню, АБО ти можеш дочекатися закінчення своєї підписки, а потім "купити" нову (АЛЕ тобі все одно потрібно написати мені, щоб я змогла повернути тебе до нашого каналу.)\n\nВибач за незручності, але ти точно знаєш, що воно того варте🥰❤️',
		ru: 'Привет! Что-то пошло не так😔 и мы не смогли произвести автоматический платеж для продления твоей подписки🙁\n\nТы всегда можешь написать мне, используя «Поддержка» в меню, ИЛИ ти можешь дождаться окончания своей подписки, а затем «купить» новую (НО тебе все равно нужно написать мне, чтобы я смогла вернуть тебя в наш канал.)\n\nИзвини за неудобства, но ты точно знаешь, что оно того стоит🥰❤️'
	},
	extendApproved: {
		en: 'Subscription has been renewed for 1 month, thank you!',
		ua: 'Підписка була продовжена на 1 місяць, дякую!',
		ru: 'Подписка была продлена на 1 месяц, спасибо!'
	},
	soonExpired: {
		en: 'Your subscription ends tomorrow, please renew it manually',
		ua: 'Твоя підписка завтра закінчиться, продовжи її вручну',
		ru: 'Твоя подписка завтра закончится, продли ее вручную'
	},
	soonAutoPay: {
		en: 'Hey there🫶🏼 Hope you’re doing well!\n\n‼️I’m writing to remind you that the next payment for your subscription is due tomorrow, but you access to the channel is for 2 more days🥰 \n\n‼️If you decide to stay(hurrah 🎉), you do nothing as your subscription is AUTOMATIC 🥰 \n\n‼️If you feel like leaving (🥲😥), you need to cancel your subscription in the menu. \n\nWhatever you decide, I’m super happy to have you here❤️',
		ua: 'Привіт🫶🏼 Сподіапюсь у тебе все добре!\n\n‼️Пишу нагадати тобі, що автоматична оплата за підсумку буде списана завтра, однак доступ до каналу в тебе ще на два дні🥰 \n\n‼️Якщо ти вирішив/ла залишитися(урааа🎉), тобі НЕ треба нічого робити, бо підписка АВТОМАТИЧНА🥰 \n\n‼️Якщо ти вирішив/ла покинути канал(🥲😥), тоді треба відмінити підписку у меню.\n\nАле в будь-якому випадку, я дуже рада, що ти тут❤️',
		ru: 'Привет🫶🏼 Надеюсь у тебя все супер! \n\n‼️Пишу напомнить тебе, что автоматическая оплата за подписку снимается завтра, но доступ в канал у тебя еще на два дня! \n\n‼️Если ты решил/ла остаться(урааа🎉), тебе НЕ нужно ничего делать, ведь подписка АВТОМАТИЧЕСКАЯ🥰\n\n‼️Если им хочешь покинуть канал(🥲😥), тебе нужно отменить подписку в меню.\n\nНо в любом случае, я очень рада, что ты здесь❤️'
	},
	cancel: {
		en: "Hey there!\n\n❌Your subscription was cancelled. \n\nI'm really sorry you're leaving. 🥲 \n\nBut you still have your current subscription to end. I hope you'll enjoy it as much as you can🤩\n\nIn case you change your mind, you may buy yourself a new subscription once your current one ends. ❤️",
		ua: 'Привіт!\n\n❌Твоя підписка скасована.\n\nМені дуже шкода, що ти йдеш. 🥲\n\nАле твоя поточна підписка ще не закінчилася. Сподіваюся, ти насолодишся днями, що залишилися з нами🤩\n\nЯкщо ти передумаєш, ти зможеш купити собі нову підписку після закінчення терміну дії поточної. ❤️',
		ru: 'Привет!\n\n❌Твоя подписка отменена.\n\nМне очень жаль, что ты уходишь. 🥲\n\nНо твоя текущая подписка еще не закончилась. Надеюсь, ты насладишься оставшимися днями с нами🤩\n\nЕсли ты передумаешь, ты сможешь купить себе новую подписку после окончания срока действия текущей. ❤️'
	},
	expired: {
		en: "Hey there!\n\nYour subscription has come to an end! Thank you for being part of our English learners-lovers community. I hope you enjoyed your journey with us. 🥰❤️\n\nYou can save the bot in case you want to come back🤩 (I'll be waiting)\n\nSee ya😘",
		ua: "Привіт!\n\nТвоя підписка закінчилася! Дякую, що ти був(ла) частиною нашого English learners-lovers ком'юніті  . Сподіваюся, тобі сподобалася твоя подорож з нами. 🥰❤️\n\nТи можеш зберегти цього бота, якщо побажаєш повернутися🤩 (я буду чекати)\n\nДо зустрічі😘",
		ru: 'Привет!\n\nТвоя подписка окончилась! Спасибо, что ты был(а) частью нашего English learners-lovers комьюнити . Надеюсь, тебе понравилось твое путешествие с нами. 🥰❤️\n\nТы можешь сохранить этот бот, если пожелаешь вернуться 🤩 (я буду ждать)\n\nДо встречи😘'
	},
	exists: {
		en: 'You already have a subscription',
		ua: 'У тебе вже є підписка',
		ru: 'У тебя уже есть подписка'
	},
	check: {
		en: '`Subscription to English with Vicky`\nAmount: %amount% %currency%\nAutomatic subscription: %autoPay%\nEnd date: %expireDate%',
		ua: '`Підписка на English with Vicky`\nСума: %amount% %currency%\nАвтоматична підписка: %autoPay%\nДата закінчення: %expireDate%',
		ru: '`Подписка на English with Vicky`\nСумма: %amount% %currency%\nАвтоматическая подписка: %autoPay%\nДата окончания: %expireDate%'
	}
}

const merchantMessages = {
	orderDesc: {
		en: '💸 Subscribe to English with Vicky',
		ua: '💸 Підписка на English with Vicky',
		ru: '💸 Подписка на English with Vicky'
	}
}

export { globalMessages, menuMessages, paymentMessages, subscribeMessages, merchantMessages }
